Repository: CofficLab/Lumi
Catalog: LumiApp/Plugins/BackgroundTaskPlugin/BackgroundAgentTask.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Actions
zh_hans: 操作
zh_hk: 操作

source: Are you sure you want to clear all completed and failed tasks? This action cannot be undone.
zh_hans: 确定要清除所有已完成和失败的任务吗？此操作不可撤销。
zh_hk: 確定要清除所有已完成和失敗的任務嗎？此操作不可撤銷。

source: Background Agent Task
zh_hans: 后台 Agent 任务
zh_hk: 後台 Agent 任務

source: Background Agent task created. The system will process this instruction in the background. You can check the task status and results later in the status bar.
zh_hans: 已创建后台 Agent 任务，系统会在后台继续处理此指令。你可以稍后在状态栏查看任务状态和结果。
zh_hk: 已創建後台 Agent 任務，系統會在後台繼續處理此指令。你可以稍後在狀態欄查看任務狀態和結果。

source: Background task completed but no model response received.
zh_hans: 后台任务已完成，但未获得模型回复。
zh_hk: 後台任務已完成，但未獲得模型回覆。

source: Background task with specified ID does not exist
zh_hans: 指定 ID 的后台任务不存在
zh_hk: 指定 ID 的後台任務不存在

source: Background Tasks
zh_hans: 后台任务
zh_hk: 後台任務

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Clear Completed
zh_hans: 清除已完成
zh_hk: 清除已完成

source: Completed
zh_hans: 已完成
zh_hk: 已完成

source: Confirm Clear
zh_hans: 确认清除
zh_hk: 確認清除

source: Create a background agent task to execute user instructions asynchronously. Suitable for long-running tasks that don't require real-time attention.
zh_hans: 接收一条用户指令，将其保存为后台 Agent 任务并在后台异步执行。适用于需要长时间运行或不需要前台实时关注的任务。
zh_hk: 接收一條用戶指令，將其保存為後台 Agent 任務並在後台異步執行。適用於需要長時間運行或不需要前台實時關注的任務。

source: Created At
zh_hans: 创建时间
zh_hk: 創建時間

source: Duration
zh_hans: 耗时
zh_hk: 耗時

source: Error Message
zh_hans: 错误信息
zh_hk: 錯誤信息

source: Failed
zh_hans: 失败
zh_hk: 失敗

source: Finished At
zh_hans: 完成时间
zh_hk: 完成時間

source: Full Instruction
zh_hans: 指令全文
zh_hk: 指令全文

source: Get detailed information about a background agent task by ID, including instruction, status, result summary, and error message.
zh_hans: 根据任务 ID 查询单个后台 Agent 任务的详细信息，包括指令、状态、结果摘要与错误信息。
zh_hk: 根據任務 ID 查詢單個後台 Agent 任務的詳細信息，包括指令、狀態、結果摘要與錯誤信息。

source: Instruction
zh_hans: 指令
zh_hk: 指令

source: Invalid LLM configuration
zh_hans: LLM 配置无效
zh_hk: LLM 配置無效

source: instruction cannot be empty
zh_hans: instruction 不能为空
zh_hk: instruction 不能為空

source: List recent background agent tasks and their status. Useful for understanding what tasks are running or have completed.
zh_hans: 列出最近的后台 Agent 任务及其状态，供你了解有哪些任务正在运行或已经完成。
zh_hk: 列出最近的後台 Agent 任務及其狀態，供你了解有哪些任務正在運行或已經完成。

source: Maximum number of tasks to return.
zh_hans: 最多返回多少条任务记录，默认 20。
zh_hk: 最多返回多少條任務記錄，預設 20。

source: No background tasks
zh_hans: 暂无后台任务
zh_hk: 暫無後台任務

source: Page %lld / %lld
zh_hans: 第 %lld / %lld 页
zh_hk: 第 %lld / %lld 頁

source: Pending
zh_hans: 等待中
zh_hk: 等待中

source: Receive instructions and execute tasks asynchronously in the background. Task results are stored in the plugin's own database.
zh_hans: 接收指令并在后台异步执行任务，任务结果存储在插件自有数据库中。
zh_hk: 接收指令並在後台異步執行任務，任務結果存儲在插件自有數據庫中。

source: Result
zh_hans: 执行结果
zh_hk: 執行結果

source: Running
zh_hans: 运行中
zh_hk: 運行中

source: Started At
zh_hans: 开始时间
zh_hk: 開始時間

source: Status
zh_hans: 状态
zh_hk: 狀態

source: Task ID of the background agent task.
zh_hans: 后台任务的 UUID 字符串。
zh_hk: 後台任務的 UUID 字符串。

source: task_id must be a valid UUID string
zh_hans: task_id 必须是有效的 UUID 字符串
zh_hk: task_id 必須是有效的 UUID 字符串

source: Total: %lld
zh_hans: 共 %lld 条
zh_hk: 共 %lld 條

source: User instruction to execute in background.
zh_hans: 用户希望在后台执行的自然语言指令。
zh_hk: 用戶希望在後台執行的自然語言指令。
